[Info] image_dim_order (from default ~/.keras/keras.json)=tf
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv3D)               (None, 16, 112, 112, 64)  5248      
_________________________________________________________________
pool1 (MaxPooling3D)         (None, 16, 56, 56, 64)    0         
_________________________________________________________________
conv2 (Conv3D)               (None, 16, 56, 56, 128)   221312    
_________________________________________________________________
pool2 (MaxPooling3D)         (None, 8, 28, 28, 128)    0         
_________________________________________________________________
conv3a (Conv3D)              (None, 8, 28, 28, 256)    884992    
_________________________________________________________________
conv3b (Conv3D)              (None, 8, 28, 28, 256)    1769728   
_________________________________________________________________
pool3 (MaxPooling3D)         (None, 4, 14, 14, 256)    0         
_________________________________________________________________
conv4a (Conv3D)              (None, 4, 14, 14, 512)    3539456   
_________________________________________________________________
conv4b (Conv3D)              (None, 4, 14, 14, 512)    7078400   
_________________________________________________________________
pool4 (MaxPooling3D)         (None, 2, 7, 7, 512)      0         
_________________________________________________________________
conv5a (Conv3D)              (None, 2, 7, 7, 512)      7078400   
_________________________________________________________________
conv5b (Conv3D)              (None, 2, 7, 7, 512)      7078400   
_________________________________________________________________
zeropad5 (ZeroPadding3D)     (None, 2, 8, 8, 512)      0         
_________________________________________________________________
pool5 (MaxPooling3D)         (None, 1, 4, 4, 512)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8192)              0         
_________________________________________________________________
fc6 (Dense)                  (None, 4096)              33558528  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
fc7 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
fc8 (Dense)                  (None, 487)               1995239   
=================================================================
Total params: 79,991,015
Trainable params: 79,991,015
Non-trainable params: 0
_________________________________________________________________
None
-------------------
Reading model file=./models/conv3d_deepnetA_sport1m_iter_1900000...
-------------------
Converting model...
[Info] Massaging "conv1a" layer...
[Info] Massaging "conv2a" layer...
[Info] Massaging "conv3a" layer...
[Info] Massaging "conv3b" layer...
[Info] Massaging "conv4a" layer...
[Info] Massaging "conv4b" layer...
[Info] Massaging "conv5a" layer...
[Info] Massaging "conv5b" layer...
[Info] Massaging "fc6-1" layer...
[Info] First FC layer after flattening layer needs special care...
[Info] Massaging "fc7-1" layer...
[Info] Massaging "fc8-1" layer...
[Info] Transplanting "conv1" layer...
[Info] Transplanting "conv2" layer...
[Info] Transplanting "conv3a" layer...
[Info] Transplanting "conv3b" layer...
[Info] Transplanting "conv4a" layer...
[Info] Transplanting "conv4b" layer...
[Info] Transplanting "conv5a" layer...
[Info] Transplanting "conv5b" layer...
[Info] Transplanting "fc6" layer...
[Info] Transplanting "fc7" layer...
[Info] Transplanting "fc8" layer...
-------------------
Saving pre-trained model weights as ./models/sports1M_weights_tf.h5...
---------------------------------------
Conversion done!
---------------------------------------
